extra_config.org
#+title: Extra config

* General
** Startup
#+begin_src emacs-lisp
(add-to-list 'default-frame-alist '(fullscreen . maximized))
#+end_src

** Doom doctor recommendations
#+begin_src elisp
(setq shell-file-name (executable-find "bash")) ;; emacs
(setq-default vterm-shell (executable-find "fish")) ;; vterm
#+end_src

** More line spacing
#+begin_src elisp
(setq line-spacing 1)
#+end_src
** Always show perspectives in minibuffer
#+begin_src elisp
;; (after! persp-mode
;;   (defun display-workspaces-in-minibuffer ()
;;     (with-current-buffer " *Minibuf-0*"
;;       (erase-buffer)
;;       (insert (+workspace--tabline))))
;;   (run-with-idle-timer 1 t #'display-workspaces-in-minibuffer)
;;   (+workspace/display))
#+end_src

* Convenience
** Global keybindings, regardless of mode
#+begin_src elisp
;; keybindings
(map!
 :n "g h" #'lsp-ui-doc-glance
 "C-c i" #'lsp-ui-imenu
 "C-c t" #'lsp-ui-imenu--refresh
 "s-[" #'winner-undo
 "s-]" #'winner-redo
 "M-s-<left>" #'winner-undo
 "M-s-<right>" #'winner-redo)
#+end_src
** Normal mode keybindings
Convenience macro to allow for multiply normal mode maps in a row
#+begin_src elisp
(defmacro normal-map! (&rest args)
  "ALIST of form (keybinding . func)"
  (let (value)
    (append (list 'map!) (dolist (arg args value)
                           (setq value (append `(:n ,(car arg) ,(cdr arg)) value))))))
#+end_src

Function to highlight everything on this line and jump to the matching end brace
#+begin_src elisp
;; visual mode select block
(defun visual-select-block ()
  (interactive)
  (evil-visual-line)
  (evil-end-of-line)
  (evil-jump-item))
#+end_src

#+begin_src elisp
;; normal mode maps
(normal-map!
 ("SPC v" . #'visual-select-block)
 ("SPC p ~" . #'project-dired)
 ("SPC o c" . #'cfw:open-org-calendar)
 ("] e" . #'flycheck-next-error)
 ("[ e" . #'flycheck-previous-error)
 ("SPC c p" . #'flycheck-projectile-list-errors)
 ("SPC b Y" . #'centaur-tabs--copy-file-name-to-clipboard)
 ("SPC f n" . #'treemacs-create-file))
#+end_src

#+RESULTS:

** Popper
[[https://github.com/karthink/popper][reference]]

#+begin_src elisp
(use-package! popper
  :bind (("C-`" . popper-toggle)
         ("s-." . popper-cycle)
         ("C-<escape>" . popper-kill-latest-popup))
  :init ;; set certain buffers to be automatically popups
  (setq popper-reference-buffers
        '("\\*Ibuffer\\*"
          "\\*Messages\\*"
          "\\*info\\*"
          "\\*helpful.*"
          "\\*Embark Export:.*"
          vterm-mode))
  :config
  (popper-mode +1))
#+end_src

Custom function to group popups based on workspace
#+begin_src elisp
(defun popper-group-by-workspace ()
  (+workspace-current-name))

(setq popper-group-function #'popper-group-by-workspace)
#+end_src

** Origami

Keybindings
#+begin_src elisp
(map!
 :after origami
 :leader
 :mode origami-mode
 :prefix ("z" . "origami")
 :n "o" #'origami-open-node
 :n "O" #'origami-open-all-nodes
 :n "c" #'origami-close-node
 :n "C" #'origami-close-all-nodes
 :n "z" #'origami-forward-toggle-node
 :n "n" #'origami-show-only-node
 :n "u" #'origami-undo)
#+end_src

* Org
TODO: investigate usage of clocking

** Variables
Used later on so have to be defined now
#+begin_src elisp
(setq +org-capture-baby-file "baby.org"
      +org-chores-file "~/org/chores.org")
#+end_src

The doom TODO statuses are suuuuper overtuned -- let's fix them
Also, going to make it so that they will work better with ~org-super-agenda-mode~

[[https://orgmode.org/manual/TODO-Extensions.html][org-todo-keywords reference]]
[[https://orgmode.org/manual/Tracking-TODO-state-changes.html][org-keywords special characters]]

#+begin_src elisp
(setq my/org-todo-keywords '(
                             ("TODO(t)" . org-todo)
                             ("NEXT(n)" .  (:foreground "#34ebd8" :weight bold :slant italic))
                             ("PROG(p!)" . +org-todo-active)
                             ("HOLD(h@)" . (:background "orange" :foreground "white")) ; in progress but held up
                             ("|")
                             ("DONE(d!)" . org-done)
                             ("WONT(w@/!)" . +org-todo-cancel)))
#+end_src

Macro to set both ~org-todo-keywords~ and ~org-todo-keyword-faces~ in one go
#+begin_src elisp
(defmacro org-keywords! (kws)
  (let ((keywords-only (seq-map #'car kws))
        (keywords-drop-special (seq-map #'(lambda (elt)
                                            (let* ((kw (car elt))
                                                   (i (seq-position kw ?\()))
                                              `(,(substring kw 0 i) . ,(cdr elt)))) kws))))
  `(setq org-todo-keywords `(sequence ,keywords-only)
         org-todo-keyword-faces ,keywords-drop-special))

;; (macroexpand '(org-keywords! my/org-todo-keywords))
#+end_src


#+begin_src elisp
;; have to set it after org loads
(after! org
  ;; keywords are the keys of the alist of ~my/org-todo-keywords~
  (setq org-todo-keywords (list (append '(sequence)
                                        (seq-map #'(lambda (elt)
                                                     (if (listp elt)
                                                         (car elt)
                                                       elt))
                                                 my/org-todo-keywords))))

  (setq org-todo-keyword-faces (let ((f (lambda (elt)
                                         (if (listp elt)
                                             `(
                                              ,(seq-take-while #'(lambda (elt) (not (equal ?\( elt))) (car elt))
                                              .
                                              ,(cdr elt))
                                           elt)
                                         )))
                                 (seq-map #'(lambda (elt) (funcall f elt)) my/org-todo-keywords)))
)
#+end_src

*** Allow for quickly setting frequently used tags
#+begin_src elisp
(setq org-tag-alist (append '((:startgroup . nil) ; at most one of the following
                              ("@home" . ?h)
                              ("@work" . ?w)
                              ("@out". ?o)
                              (:endgroup . nil)
                              ;; any of the following
                              ("project" . ?p)
                              ("learning" . ?l))
                            org-tag-alist-for-agenda))
#+end_src
** Open org agenda in a popup buffer window

I wrote this function myself! Super proud
#+begin_src elisp
(defun org-agenda-popup ()
  (interactive)
  (let ((buf (get-buffer-create "*Org Agenda*"))
        (org-agenda-start-day nil)
        (org-agenda-span 1))
    (display-buffer buf '(display-buffer-pop-up-window . ((dedicated . t) (window-width . 80))))
    (org-agenda nil "c")))

(map! :n "SPC w a" #'org-agenda-popup)
#+end_src
