extra_config.el
(add-to-list 'default-frame-alist '(fullscreen . maximized))

(setq shell-file-name (executable-find "bash")) ;; emacs
(setq-default vterm-shell (executable-find "fish")) ;; vterm

(setq line-spacing 1)

;; (after! persp-mode
;;   (defun display-workspaces-in-minibuffer ()
;;     (with-current-buffer " *Minibuf-0*"
;;       (erase-buffer)
;;       (insert (+workspace--tabline))))
;;   (run-with-idle-timer 1 t #'display-workspaces-in-minibuffer)
;;   (+workspace/display))

;; keybindings
(map!
 :n "g h" #'lsp-ui-doc-glance
 "C-c i" #'lsp-ui-imenu
 "C-c t" #'lsp-ui-imenu--refresh
 "s-[" #'winner-undo
 "s-]" #'winner-redo
 "M-s-<left>" #'winner-undo
 "M-s-<right>" #'winner-redo)

(defmacro normal-map! (&rest args)
  "ALIST of form (keybinding . func)"
  (let (value)
    (append (list 'map!) (dolist (arg args value)
                           (setq value (append `(:n ,(car arg) ,(cdr arg)) value))))))

;; visual mode select block
(defun visual-select-block ()
  (interactive)
  (evil-visual-line)
  (evil-end-of-line)
  (evil-jump-item))

;; normal mode maps
(normal-map!
 ("SPC v" . #'visual-select-block)
 ("SPC p ~" . #'project-dired)
 ("SPC o c" . #'cfw:open-org-calendar)
 ("] e" . #'flycheck-next-error)
 ("[ e" . #'flycheck-previous-error)
 ("SPC c p" . #'flycheck-projectile-list-errors)
 ("SPC b Y" . #'centaur-tabs--copy-file-name-to-clipboard)
 ("SPC f n" . #'treemacs-create-file))

(use-package! popper
  :bind (("C-`" . popper-toggle)
         ("s-." . popper-cycle)
         ("C-<escape>" . popper-kill-latest-popup))
  :init ;; set certain buffers to be automatically popups
  (setq popper-reference-buffers
        '("\\*Ibuffer\\*"
          "\\*Messages\\*"
          "\\*info\\*"
          "\\*helpful.*"
          "\\*Embark Export:.*"
          vterm-mode))
  :config
  (popper-mode +1))

(defun popper-group-by-workspace ()
  (+workspace-current-name))

(setq popper-group-function #'popper-group-by-workspace)

(map!
 :after origami
 :leader
 :mode origami-mode
 :prefix ("z" . "origami")
 :n "o" #'origami-open-node
 :n "O" #'origami-open-all-nodes
 :n "c" #'origami-close-node
 :n "C" #'origami-close-all-nodes
 :n "z" #'origami-forward-toggle-node
 :n "n" #'origami-show-only-node
 :n "u" #'origami-undo)

(setq +org-capture-baby-file "baby.org"
      +org-chores-file "~/org/chores.org")

(setq my/org-todo-keywords '(
                             ("TODO(t)" . org-todo)
                             ("NEXT(n)" .  (:foreground "#34ebd8" :weight bold :slant italic))
                             ("PROG(p!)" . +org-todo-active)
                             ("HOLD(h@)" . (:background "orange" :foreground "white")) ; in progress but held up
                             ("|")
                             ("DONE(d!)" . org-done)
                             ("WONT(w@/!)" . +org-todo-cancel)))

(defmacro org-keywords! (kws)
  (let ((keywords-only (seq-map #'car kws))
        (keywords-drop-special (seq-map #'(lambda (elt)
                                            (let* ((kw (car elt))
                                                   (i (seq-position kw ?\()))
                                              `(,(substring kw 0 i) . ,(cdr elt)))) kws))))
  `(setq org-todo-keywords `(sequence ,keywords-only)
         org-todo-keyword-faces ,keywords-drop-special))

;; (macroexpand '(org-keywords! my/org-todo-keywords))

;; have to set it after org loads
(after! org
  ;; keywords are the keys of the alist of ~my/org-todo-keywords~
  (setq org-todo-keywords (list (append '(sequence)
                                        (seq-map #'(lambda (elt)
                                                     (if (listp elt)
                                                         (car elt)
                                                       elt))
                                                 my/org-todo-keywords))))

  (setq org-todo-keyword-faces (let ((f (lambda (elt)
                                         (if (listp elt)
                                             `(
                                              ,(seq-take-while #'(lambda (elt) (not (equal ?\( elt))) (car elt))
                                              .
                                              ,(cdr elt))
                                           elt)
                                         )))
                                 (seq-map #'(lambda (elt) (funcall f elt)) my/org-todo-keywords)))
)

(setq org-tag-alist (append '((:startgroup . nil) ; at most one of the following
                              ("@home" . ?h)
                              ("@work" . ?w)
                              ("@out". ?o)
                              (:endgroup . nil)
                              ;; any of the following
                              ("project" . ?p)
                              ("learning" . ?l))
                            org-tag-alist-for-agenda))

(defun org-agenda-popup ()
  (interactive)
  (let ((buf (get-buffer-create "*Org Agenda*"))
        (org-agenda-start-day nil)
        (org-agenda-span 1))
    (display-buffer buf '(display-buffer-pop-up-window . ((dedicated . t) (window-width . 80))))
    (org-agenda nil "c")))

(map! :n "SPC w a" #'org-agenda-popup)

(org-super-agenda-mode)
