extra_config.org
** org-super-agenda-mode
~org-super-agenda-mode~ gives a much prettier, organized agenda

#+begin_src elisp
(org-super-agenda-mode)
(setq org-agenda-custom-commands
      '(("c" "Super agenda"
         ((agenda "" ((org-agenda-overriding-header "")
                      (org-super-agenda-groups
                       '((:log t)
                         (:name "Overdue"
                          :deadline past)
                         (:name "Habits"
                          :habit t)
                         (:name "Today"
                          :time-grid t
                          :date today)
                         (:name "Important"
                          :priority "A"
                          :face (:weight ultra-bold :background "blue")
                          :order 1)
                         (:name "Unstarted"
                          :scheduled past)
                         ))))
          (alltodo "" ((org-agenda-overriding-header "")
                       (org-super-agenda-groups
                        `((:log t)
                          (:name "Important"
                           :priority "A"
                           :face (:weight ultra-bold :background "blue")
                           :order 0)
                          (:name "Next"
                           :todo "NEXT"
                           :order 2)
                         (:name "Coming up"
                                :scheduled future)
                          (:name "In progress"
                           :todo "PROG"
                           :order 1)
                          (:name "Daphne"
                           :tag "daphne")
                          (:name "Chores"
                           :file-path ,(expand-file-name +org-chores-file) ; back-quoted list allows evaluation with `,`
                           :face (:slant italic)
                           :order 3)
                          (:name "Can wait"
                           :priority "C")
                          (:name "If time"
                           :priority "B")
                          (:discard (:file-path ,(expand-file-name "~/org/bills.org")))
                          (:discard (:file-path ,(expand-file-name "~/org/habits.org")))))))))))
#+end_src
** org roam
*** Directory
#+begin_src elisp
(setq org-roam-directory "~/org-roam")
#+end_src

*** Capture templates
#+begin_src elisp
(setq org-roam-dailies-capture-templates
      '(("d" "default" entry "* %<%I:%M %p>: %?"
         :if-new (file+head "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n")
         :unnarrowed t
         :empty-lines-before 1)))

(setq org-roam-capture-templates '(("c" "default" plain "%?"
                                    :target (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
                                                       "#+title: ${title}\n")
                                    :unnarrowed t)
                                   ("n" "node" entry "* %?"
                                    :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
                                                       "#+title: ${title}\n")
                                    :empty-lines-before 1)))
#+end_src
** Capture templates

TODO -- contexts? [[https://orgmode.org/manual/Templates-in-contexts.html][See here]]
TODO: might be useful to write some function that stores the todo under a heading for the directory we're in (for project level todos)
#+begin_src elisp
(after! org
  (setq +org-capture-agenda-file "~/org/agenda.org")
  (setq org-capture-templates (append '(
                                        ("a" "Agenda")
                                        ("ad" "Deadline" entry
                                         (file+olp+datetree +org-capture-agenda-file)
                                         "* %?\nDEADLINE: %^{at}t")
                                        ("t" "Todos")
                                        ("tt" "project todo" entry
                                         (file "~/org/projects.org")
                                         "* TODO %?\n%i")
                                        ("tn" "today" entry
                                         (file+headline "~/org/todo.org" "Todos")
                                         "* TODO %?\n%t")
                                        ("td" "deadline" entry
                                         (file+headline "~/org/todo.org" "Todos")
                                         "* TODO %?\nDEADLINE: %^{at}t")
                                        ("ts" "scheduled" entry
                                         (file+headline "~/org/todo.org" "Todos")
                                         "* TODO %?\nSCHEDULED: %^{at}t")
                                        ("tf" "file todo" entry
                                         (file+headline "~/org/projects.org" "Project todos")
                                         "* TODO %? %^g\n%a")
                                        ("c" "chore" entry
                                         (file +org-chores-file)
                                         "* TODO %?\nDEADLINE: %t")
                                        ) org-capture-templates))
  )
#+end_src
** Babel
#+begin_src elisp
(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (elixir . t)))
#+end_src

* Language-specific
** Go
#+begin_src elisp
(setq lsp-go-use-gofumpt t)
(eval-after-load 'flycheck
  '(add-hook 'flycheck-mode-hook #'flycheck-golangci-lint-setup))

#+end_src

*** hooks
#+begin_src elisp
(add-hook! 'go-mode-hook
  (add-hook! 'before-save-hook #'lsp-format-buffer t t)
  (add-hook! 'before-save-hook #'lsp-organize-imports t t))
(add-hook! 'go-ts-mode-hook
  (lsp))
** TSX

#+begin_src elisp
(add-hook! 'tsx-ts-mode
  (lsp)
  (setq-local tab-width 4))
#+end_src

Format on save
#+begin_src elisp
(add-hook! 'tsx-ts-mode
  (add-hook! 'before-save-hook #'+format/buffer))
#+end_src

*** Prettier
#+begin_src elisp
(add-hook! 'tsx-ts-mode 'prettier-js-mode)
(setq prettier-js-args '(
                         "--trailing-comma" "es5"
                         "--bracket-spacing" "true"
                         "--single-quote" "true"
                         ))
#+end_src

* K8s helm

Create an LSP for k8s helm so that I get nice syntax highlighting and definitions
#+begin_src elisp
(define-derived-mode k8s-helm-mode yaml-mode "Helm"
  "A mode for editing helm charts.
  \\{k8s-helm-mode-map}")

(after! lsp-mode
  (add-to-list 'lsp-language-id-configuration '(k8s-helm-mode . "yaml"))

  (lsp-register-client (make-lsp-client
                        :new-connection (lsp-stdio-connection '("helm_ls" "serve"))
                        :activation-fn (lsp-activate-on "yaml")
                        :server-id 'yaml))
  )

(add-hook! 'k8s-helm-mode
  (lsp))
#+end_src
* Treesitter
Treesitter is helpful for syntax highlighting and supposedly has faster node navigation
#+begin_src elisp
(setq treesit-font-lock-level 4)

(setq treesit-language-source-alist
      '((tsx        "https://github.com/tree-sitter/tree-sitter-typescript"
         "v0.20.3"
         "tsx/src")
        (typescript "https://github.com/tree-sitter/tree-sitter-typescript"
                    "v0.20.3"
                    "typescript/src")
        (rust "https://github.com/tree-sitter/tree-sitter-rust")
        (go "https://github.com/tree-sitter/tree-sitter-go")
        (gomod "https://github.com/tree-sitter/tree-sitter-go-mod")
        (javascript "https://github.com/tree-sitter/tree-sitter-javascript")
        (templ "https://github.com/vrischmann/tree-sitter-templ")))
#+end_src

