extra_config.org
*** Use-package
#+begin_src emacs-lisp
(use-package! sticky-scroll-mode)
#+end_src

* Hacks
** Remove file watches
#+begin_src elisp
(defun file-notify-rm-all-watches ()
  "Remove all existing file notification watches from Emacs."
  (interactive)
  (maphash
   (lambda (key _value)
     (file-notify-rm-watch key))
   file-notify-descriptors))
#+end_src

* Treemacs theme
#+begin_src elisp
(setq doom-themes-treemacs-theme "doom-colors")
#+end_src
