extra_config.el

(use-package! sticky-scroll-mode)

(defun file-notify-rm-all-watches ()
  "Remove all existing file notification watches from Emacs."
  (interactive)
  (maphash
   (lambda (key _value)
     (file-notify-rm-watch key))
   file-notify-descriptors))

(setq doom-themes-treemacs-theme "doom-colors")
